app/views/installations/show.html.erb

SELECT "beacons".* FROM "beacons"  WHERE "beacons"."installation_id" = $1  [["installation_id", 3]]
---
      <% n = 1 %>
      <% @installation.beacons.find_each do |beacon| %>