app/views/customers/index.json.jbuilder

json.array!(@customers) do |customer|
	customer.installations.each do |installation|
---
SELECT "installations".* FROM "installations"  WHERE "installations"."customer_id" = $1  [["customer_id", 1]]