app/controllers/beacons_controller.rb

  def create
    @beacon = Beacon.new(beacon_params)
    set_beacon_installation_id
    if @beacon.save
---
INSERT INTO "beacons" ("audio", "content", "content_type", "created_at", "minor_id", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["audio", "Content"], ["content", "First beacon"], ["content_type", "Content"], ["created_at", "2014-07-15 11:35:03.374435"], ["minor_id", 357], ["updated_at", "2014-07-15 11:35:03.374435"]]

  def destroy
    @beacon.destroy
---
DELETE FROM "beacons" WHERE "beacons"."id" = $1  [["id", 4]]

  def set_customer_and_installation
    @customer = Customer.find(params[:customer_id])
    @installation = Installation.find(params[:installation_id])
---
SELECT  "installations".* FROM "installations"  WHERE "installations"."id" = $1 LIMIT 1  [["id", 3]]

  def set_beacon
    @beacon = Beacon.find(params[:id])
---
SELECT  "beacons".* FROM "beacons"  WHERE "beacons"."id" = $1 LIMIT 1  [["id", 4]]