app/controllers/customers_controller.rb

  def index
    # Watch RailsCasts
    # Function should be, increment by 1 mile until 5 results are shown
    @customers = Customer.all
---
SELECT "customers".* FROM "customers"

  def create
    @customer = Customer.new(customer_params)
    @customer.activation_code = SecureRandom.hex
    respond_to do |format|
      if @customer.save
---
INSERT INTO "customers" ("category", "created_at", "name", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["category", "museums"], ["created_at", "2014-06-30 21:08:03.134133"], ["name", "moca"], ["updated_at", "2014-06-30 21:08:03.134133"]]