app/controllers/installations_controller.rb

  def show
    if request.format.json?
      @installation = Installation.find_by id: params[:id]
      @installation.beacons.each do |beacon|
---
SELECT  "installations".* FROM "installations"  WHERE "installations"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "beacons".* FROM "beacons"  WHERE "beacons"."installation_id" = $1  [["installation_id", 3]]

  def create
    @installation = Installation.new(installation_params)
    set_customer_id
    respond_to do |format|
      if @installation.save
---
INSERT INTO "installations" ("beacon_id", "content", "created_at", "name", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["beacon_id", 1], ["content", "Testing strong params\r\n"], ["created_at", "2014-06-30 15:59:30.207114"], ["name", "colin"], ["updated_at", "2014-06-30 15:59:30.207114"]]

  def destroy
    @installation.destroy
---
DELETE FROM "installations" WHERE "installations"."id" = $1  [["id", 1]]

    def set_installation
      @installation = @customer.installations.find(params[:id])
---
SELECT  "installations".* FROM "installations"  WHERE "installations"."id" = $1 LIMIT 1  [["id", 20]]